//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   GameOver.cpp
//!
//! @brief  ゲームオーバー処理のソースファイル
//!
//! @date   2016/11/04		
//!
//! @author 山田唯真
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// ヘッダファイルの読み込み ================================================
#include "..\..\Game.h"
#include "GameOver.h"
using namespace DirectX::SimpleMath;
using namespace DirectX;

//----------------------------------------------------------------------
//! @brief ゲムオバコンストラクタ
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
Over::Over(RenderingResourceManager* rrm)
	:GameBase(GameBase::OVER, rrm)
{

}

//----------------------------------------------------------------------
//! @brief ゲムオバデストラクタ
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
Over::~Over()
{

}

//----------------------------------------------------------------------
//! @brief ゲムオバ処理
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
void Over::Update()
{
	if (GetInit() == false){
		ChangeInit();

		//PlaySoundMem(g_se, DX_PLAYTYPE_BACK);
	}
}


//----------------------------------------------------------------------
//! @brief ゲームオーバー描画処理
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
void Over::Render()
{
	/*wchar_t buf[256];

	swprintf_s(buf, 256, L"OVER");
	g_spriteFont->DrawString(g_spriteBatch.get(), buf, Vector2(100, 0));*/

}