//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   GameLogo.cpp
//!
//! @brief  ロゴ処理のソースファイル
//!
//! @date   2016/11/04		
//!
//! @author 山田唯真
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// ヘッダファイルの読み込み ================================================
#include "..\..\Game.h"
#include "GameLogo.h"
using namespace DirectX::SimpleMath;
using namespace DirectX;

//----------------------------------------------------------------------
//! @brief ロゴコンストラクタ
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
Logo::Logo(RenderingResourceManager* rrm)
	:GameBase(GameBase::LOGO, rrm)
	,m_time(0)
{

}

//----------------------------------------------------------------------
//! @brief ロゴデストラクタ
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
Logo::~Logo()
{

}

//----------------------------------------------------------------------
//! @brief ロゴ処理
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
void Logo::Update()
{
	//シーン初めの処理
	if (GetInit() == false){
		ChangeInit();
	}

	//時間をカウント
	m_time++;
	//規定時間でシーン変更
	if (m_time > CHANGE_SCENE_TIME)
	{
		//g_NextScene = TITLE;
		SetScene(GameBase::TITLE);
	}
}

//----------------------------------------------------------------------
//! @brief ロゴ描画処理
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
void Logo::Render()
{
	
}

